In [1]:
import numpy as np 
import pandas as pd

## operation

In [2]:
df1 = pd.DataFrame({
    'a': [1,2,3,4,5],
    'b': [10,20,30,40,50],
    'c': [100,200,300,400,500]
})

In [3]:
df1

   a   b    c
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [4]:
df1.shape

(5, 3)

In [6]:
df1.columns

Index(['a', 'b', 'c'], dtype='object')

In [7]:
df1.info

<bound method DataFrame.info of    a   b    c
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500>

In [12]:
df1.describe()

              a          b           c
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [13]:
df1['a']+10

0    11
1    12
2    13
3    14
4    15
Name: a, dtype: int64

## aplying some function

In [14]:
df1

   a   b    c
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [15]:
def square(x):
    return x**2

In [22]:
df1['d'] = df1['a'].apply(square) #creating a new column

In [21]:
df1

    a   b    c    d
0   1  10  100    1
1   4  20  200   16
2   9  30  300   81
3  16  40  400  256
4  25  50  500  625